<details ><summary>apply for portal 2025-03-06 01:06:42 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.portal[0] will be created
  + resource "cloudns_dns_record" "portal" {
      + id    = (known after apply)
      + ttl   = 600
      + type  = "A"
      + value = (known after apply)
      + zone  = "lumeportal.com"
    }

  # cloudns_dns_record.portal_wildcard[0] will be created
  + resource "cloudns_dns_record" "portal_wildcard" {
      + id    = (known after apply)
      + name  = "*"
      + ttl   = 600
      + type  = "A"
      + value = (known after apply)
      + zone  = "lumeportal.com"
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
module.portal[0].module.portal_deployment.akash_deployment.service: Creating...
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Creation complete after 28s [id=20513106:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.portal[0]: Creating...
cloudns_dns_record.portal_wildcard[0]: Creating...
cloudns_dns_record.portal[0]: Creation complete after 1s [id=584211377]
cloudns_dns_record.portal_wildcard[0]: Creation complete after 1s [id=584211386]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:32303"
renterd_bus_endpoint = "bus.lumeportal-portal-renterd-cluster.node.lumeportal.com"

```
</details>
</details>